var supData="";
var airportMap = {} ;
var airportName;
$(function(){
/********************************************地图JS*************************************************************/
    var dom = document.getElementById("container");
    var myChart = echarts.init(dom);
    var geoCoordMap = {};
    var newData=[];
    $.ajax(
        {
            type:'get',
            url : '/getAirportOnLineData',
            dataType : 'jsonp',
            success : function(data) {
                if(data){
                    airportMap = data.success.airportInfoMap;
                    airportName = data.success.airportName;
                    var onLineData = [];
                    for(var int = 0; int<data.success.airportOnLineData.length;int++){
                    	if(data.success.airportOnLineData[int].flyNum!=""){
                    		onLineData.push(data.success.airportOnLineData[int]);
                    	}
                    }
                    data.success.airportOnLineData = onLineData;
                    mid(data);
                    $(".pla-success").eq(0).html(data.success.earning);
                    $(".pla-success").eq(1).html(data.success.allPerson);
                    $(".pla-success").eq(2).html(data.success.onTime);
                    $("#datee").html(data.success.datee);
                    $("#airport").html(airportMap[data.success.airportCode].aptChaNam);
                    getLinesData(data);
                }
            },
            error : function() {

            }
        }
    );
    option = null;
    var Odata;
    function mid(data1){
        Odata=data1;
        var datatemp = data1.success.airportOnLineData;
        var data = [];
        //三字码转化为城市名字--地图显示
        for(var index in datatemp){
        	var temp = datatemp[index];
        	var tempObject = new Object();
        	if(""!=temp.flyNum){
	        	tempObject.airport = airportMap[temp.airport].ctyChaNam;
	        	
	        	tempObject.arrAirport = airportMap[temp.arrAirport].ctyChaNam;
	        	if(typeof(temp.dptAirport) != "undefined"){
	        		tempObject.dptAirport = airportMap[temp.dptAirport].ctyChaNam;
	        	}
	        	tempObject.flyNum = temp.flyNum;
	        	data.push(tempObject);
        	}
        }
        for(var index in data1.success.cityCoordinateList){
            var key = data1.success.cityCoordinateList[index].cityName;
            var valuee =data1.success.cityCoordinateList[index].cityCoordinatee;
            var array = valuee.split(",");
            geoCoordMap[key] =array;    //赋值城市经纬度
        }
        option.bmap.center=geoCoordMap[Odata.success.airportName];//设置居中位置
        /*航线组装*/
        var Sdata = [];
        for(var index in data){
            var one2 = [];
            var airport2 = {};
            var arrAirport2 = {};
            var dptAirport2 = {};
            airport2.name = data[index].airport;
            airport2.value = 30;
            arrAirport2.name = data[index].arrAirport;
            arrAirport2.value = 30;

            one2.push(airport2);
            if(data[index].dptAirport!=null){
                dptAirport2.name = data[index].dptAirport;
                dptAirport2.value = 30;
                one2.push(dptAirport2);
            }
            one2.push(arrAirport2);
            Sdata.push(one2);
        }
        for(var i=0;i<Sdata.length;i++){
            if(Sdata[i].length==3){
                var tag=1;
                var midData=[];
                if(Sdata[i][0].name==Odata.success.airportName){
                    midData.push(Sdata[i][0],Sdata[i][1]);
                    midData.push(Sdata[i][1],Sdata[i][2]);
                }else {
                    midData.push(Sdata[i][1],Sdata[i][0]);
                    midData.push(Sdata[i][1],Sdata[i][2]);
                }
                for(var j=0;j<newData.length;j++){
                    if(midData[0].name==newData[j][0].name&&midData[1].name==newData[j][1].name){
                        tag=0;
                    }
                }
                if(tag==1){
                    newData.push(midData);
                }
                midData=[];
                tag=1;
                midData.push(Sdata[i][1],Sdata[i][2]);
                for(var j=0;j<newData.length;j++){
                    if(midData[0].name==newData[j][0].name&&midData[1].name==newData[j][1].name){
                        tag=0;
                    }
                }
                if(tag==1){
                    newData.push(midData);
                }
            }else if(Sdata[i].length==2){
                var midData=[];
                midData.push(Sdata[i][0],Sdata[i][1]);
                newData.push(midData);
                midData=[];
            }
        }
        HBData=newData;
        demo();
    }
    var HBData = "";
    var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';
    var planePath1 = 'path://M511.983627 1022.005576c-177.413666 0-356.430852-48.131207-356.430852-155.653059 0-83.935668 122.605386-135.997394 236.549507-148.835793l6.237051-0.718361L240.863766 464.627063c-5.077645-9.096169-9.868765-18.74697-14.093996-28.512381l-4.1536-8.400321-0.652869-3.360538c-13.843286-35.848463-20.852934-73.371054-20.852934-111.49842 0-171.404812 139.484821-310.86098 310.917262-310.86098 171.427324 0 310.887586 139.456169 310.887586 310.86098 0 38.164205-7.024997 75.670423-20.906146 111.49842l-2.082428 5.38873 0.194428 0-1.603521 3.300162c-4.535293 10.694573-9.552563 20.965497-15.000646 30.699186L511.853667 914.597311l-64.345494-105.092523-2.430352 0.211824c-104.22783 8.933463-170.69873 37.702694-188.130751 53.720505l-3.148713 2.898003 3.148713 2.914376c22.738887 21.12411 110.175285 54.535057 248.78825 55.520501l12.375865 0.020466-0.016373-0.020466c138.357138-0.969071 225.969545-34.304294 248.898767-55.385425l3.229554-2.967588-3.284813-2.898003c-12.722766-11.271718-59.075467-33.511231-130.370233-46.566572l54.754045-87.675852c114.248044 25.745361 177.125093 74.360592 177.125093 137.074935 0 107.527992-179.017186 155.653059-356.453365 155.653059L511.983627 1022.004553zM511.977487 145.159054c-73.081459 0-132.527362 59.488883-132.527362 132.598994 0 73.05076 59.440787 132.48029 132.527362 132.48029 73.132624 0 132.62253-59.429531 132.62253-132.48029C644.600017 204.647937 585.110111 145.159054 511.977487 145.159054L511.977487 145.159054zM511.977487 145.159054';
//    var planePath2 = 'path://M786.496 161.163l-3.537-3.507C713.308 88.89 617.627 46.381 511.992 46.381c-105.507 0-201.123 42.418-270.76 111.073l-3.926 3.911c-68.646 69.668-111.074 165.237-111.074 270.775 0 105.633 42.495 201.295 111.275 270.965l3.522 3.508 270.978 271.006 271.169-271.146 3.132-3.164c68.889-69.697 111.459-165.424 111.459-271.164C897.772 326.521 855.277 230.86 786.496 161.163L786.496 161.163zM512.008 541.766c-74.545 0-134.974-60.447-134.974-134.977 0-30.806 10.283-59.152 27.614-81.856 24.663-32.299 63.574-53.151 107.359-53.151 74.55 0 134.978 60.463 134.978 135.008C646.985 481.318 586.558 541.766 512.008 541.766L512.008 541.766zM512.008 541.766';
    var convertData = function (data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
            var dataItem = data[i];
            var fromCoord = geoCoordMap[dataItem[0].name];
            var toCoord = geoCoordMap[dataItem[1].name];
            if (fromCoord && toCoord) {
                res.push({
                    fromName: dataItem[0].name,
                    toName: dataItem[1].name,
                    coords: [fromCoord, toCoord]
                });
            }
        }
        //去重
        var retres = [];
        for(var a in res){
        	var afromName = res[a].fromName;
        	var atoName = res[a].toName;
        	var acoords = res[a].coords;
        	var a = 1;
        	if(retres.length>0){
        		for(var b in retres){
        			var bfromName = retres[b].fromName;
                	var btoName = retres[b].toName;
                	if((afromName.trim()==bfromName.trim())&&(atoName.trim()==btoName.trim())){
                		a = 0;
                	}
            	}
        		if(a==1){
        			retres.push({
                        fromName: afromName,
                        toName: atoName,
                        coords: acoords
                    });
        		}
        	}else{
        		retres.push({
                    fromName: afromName,
                    toName: atoName,
                    coords: acoords
                });
        	}
        	
        }
        return retres;
    };
    /**/
    var convertData1 = function (data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
            var geoCoord = geoCoordMap[data[i].name];
            if (geoCoord) {
                res.push({
                    name: data[i].name,
                    value: geoCoord.concat(data[i].value)
                });
            }
        }
        return res;
    };
    var color = ['#fb9c4e', '#ffa022', '#46bnewData9'];
    var series = [];
    function demo(){
        series = [];
        var amap = { 
        		"阿坝红原机场":                              [               102.365627    ,              32.532957           ]              ,
        	    "阿尔山伊尔施机场":                            [               119.929568    ,              47.315574           ]              ,
        	 	"阿克苏温宿机场":                             [               80.248304     ,              41.260367           ]              ,
        	 	"阿勒泰机场 ":                              [               88.096306     ,              47.760323           ]              ,
        	 	"阿里昆莎机场":                              [               80.062168     ,              32.11347            ]              ,
        	 	"安康富强机场":                              [               109.038045    ,              32.70437            ]              ,
        	 	"安庆天柱山机场":                             [               117.058934    ,              30.588697           ]              ,
        	 	"鞍山腾鳌机场":                              [               122.868804    ,              41.108653           ]              ,
        	 	"安顺黄果树机场 ":                            [               105.883145    ,              26.259809           ]              ,
        	 	"安阳北郊机场":                              [               114.358908    ,              36.134479           ]              ,
        	 	"澳门国际机场":                              [               113.586672    ,              22.160557           ]              ,
        	 	"百色田阳机场":                              [               106.978638    ,              23.721448           ]              ,
        	 	"保山云端机场":                              [               99.177996     ,              25.120489           ]              ,
        	 	"包头二里半机场":                             [               110.01111     ,              40.571959           ]              ,
        	 	"巴彦淖尔天吉泰机场":                           [               107.753707    ,              40.930387           ]              ,
        	 	"北海福成机场":                              [               109.298737    ,              21.546925           ]              ,
        	 	"北京南苑国际机场":                            [               116.403467    ,              39.797624           ]              ,
        	 	"北京首都国际机场":                            [               116.62117     ,              40.0611             ]              ,
        	 	"毕节飞雄机场":                              [               105.487725    ,              27.26632            ]              ,
        	 	"博乐阿拉山口机场":                            [               82.309316     ,              44.906311           ]              ,
        	 	"布尔津喀纳斯机场":                            [               87.011791     ,              48.230671           ]              ,
        	 	"长白山机场 ":                              [               127.620841    ,              42.072469           ]              ,
        	 	"长春龙嘉国际机场":                            [               125.703786    ,              44.000999           ]              ,
        	 	"常德桃花源机场":                             [               111.649933    ,              28.926913           ]              ,
        	 	"昌都邦达机场":                              [               97.113613     ,              30.554397           ]              ,
        	 	"长海大长山岛机场":                            [               122.676109    ,              39.273791           ]              ,
        	 	"长沙黄花国际机场":                            [               113.226919    ,              28.192531           ]              ,
        	 	"长治王村机场":                              [               113.134367    ,              36.251826           ]              ,
        	 	"常州奔牛国际机场":                            [               119.790679    ,              31.917769           ]              ,
        	 	"朝阳机场":                                [               120.448886    ,              41.552705           ]              ,
        	 	"成都双流国际机场":                            [               103.965204    ,              30.584712           ]              ,
        	 	"赤峰玉龙机场":                              [               118.844597    ,              42.162092           ]              ,
        	 	"池州九华山机场":                             [               117.695397    ,              30.742646           ]              ,
        	 	"重庆江北国际机场":                            [               106.648039    ,              29.727675           ]              ,
        	 	"大理荒草坝机场":                             [               100.330443    ,              25.653529           ]              ,
        	 	"丹东浪头国际机场":                            [               124.338543    ,              40.129023           ]              ,
        	 	"稻城亚丁机场":                              [               100.073237    ,              29.315215           ]              ,
        	 	"大庆萨尔图机场":                             [               125.145801    ,              46.755079           ]              ,
        	 	"大同云冈机场":                              [               113.493758    ,              40.063971           ]              ,
        	 	"达州河市机场":                              [               107.437962    ,              31.13643            ]              ,
        	 	"德宏芒市机场":                              [               98.536384     ,              24.4085             ]              ,
        	 	"迪庆香格里拉机场":                            [               99.689555     ,              27.799121           ]              ,
        	 	"东营胜利机场":                              [               118.796593    ,              37.515693           ]              ,
        	 	"敦煌莫高煌机场":                             [               94.811024     ,              40.173482           ]              ,
        	 	"大连周水子国际机场":                           [               121.550463    ,              38.968846           ]              ,
        	 	"鄂尔多斯伊金霍洛国际机场":                        [               109.7547      ,              39.570114           ]              ,
        	 	"额济纳旗桃来机场":                            [               100.099512    ,              41.6938             ]              ,
        	 	"恩施许家坪机场":                             [               109.492771    ,              30.325586           ]              ,
        	 	"二连浩特赛乌苏国际机场":                         [               111.966178    ,              43.41778            ]              ,
        	 	"佛山沙堤机场":                              [               113.076516    ,              23.073277           ]              ,
        	 	"阜阳西关机场":                              [               115.750676    ,              32.882857           ]              ,
        	 	"抚远东极机场":                              [               130.469934    ,              46.853251           ]              ,
        	 	"富蕴可可托海机场":                            [               89.522567     ,              46.815726           ]              ,
        	 	"福州长乐国际机场":                            [               119.681241    ,              25.934816           ]              ,
        	 	"甘南夏河机场":                              [               102.628797    ,              34.828596           ]              ,
        	 	"赣州黄金机场":                              [               114.78979     ,              25.851316           ]              ,
        	 	"甘孜康定":                                [               101.963067    ,              30.004501           ]              ,
        	 	"高雄国际机场":                              [               80.450486     ,              32.036237           ]              ,
        	 	"格尔木机场":                               [               94.796812     ,              36.408467           ]              ,
        	 	"广元盘龙机场":                              [               105.711194    ,              32.39893            ]              ,
        	 	"广州白云国际机场":                            [               113.309493    ,              23.392435           ]              ,
        	 	"桂林两江国际机场":                            [               110.058192    ,              25.221343           ]              ,
        	 	"贵阳龙洞堡国际机场":                           [               106.807162    ,              26.549112           ]              ,
        	 	"固原六盘山机场":                             [               106.232272    ,              36.082673           ]              ,
        	 	"哈尔滨太平国际机场":                           [               126.246145    ,              45.629936           ]              ,
        	 	"海口美兰国际机场":                            [               110.468596    ,              19.944221           ]              ,
        	 	"呼伦贝尔东山机场":                            [               119.833005    ,              49.218347           ]              ,
        	 	"哈密机场":                                [               93.66387      ,              42.846955           ]              ,
        	 	"邯郸机场":                                [               114.441706    ,              36.530018           ]              ,
        	 	"杭州萧山国际机场":                            [               120.443764    ,              30.241497           ]              ,
        	 	"汉中城固机场":                              [               107.208124    ,              33.127829           ]              ,
        	 	"河池金城江机场":                             [               107.750931    ,              24.823152           ]              ,
        	 	"合肥新桥国际机场":                            [               116.976059    ,              31.9929             ]              ,
        	 	"海西德令哈机场 ":                            [               97.275112     ,              37.144622           ]              ,
        	 	"黑河瑷珲机场":                              [               127.326404    ,              50.186652           ]              ,
        	 	"恒春五里亭机场 ":                            [               121.973871    ,              24.086957           ]              ,
        	 	"衡阳南岳机场":                              [               112.62556     ,              26.72638            ]              ,
        	 	"和田机场  ":                              [               79.881109     ,              37.046612           ]              ,
        	 	"淮安涟水国际机场":                            [               119.141458    ,              33.79383            ]              ,
        	 	"怀化芷江机场":                              [               109.712109    ,              27.447604           ]              ,
        	 	"花莲机场  ":                              [               110.476602    ,              19.437612           ]              ,
        	 	"黄山屯溪国际机场":                            [               118.265538    ,              29.733374           ]              ,
        	 	"花土沟机场 ":                              [               90.842911     ,              38.210324           ]              ,
        	 	"呼和浩特白塔国际机场":                          [               111.829296    ,              40.860529           ]              ,
        	 	"惠州平潭机场":                              [               114.613646    ,              23.056166           ]              ,
        	 	"加格达奇嘎仙机场":                            [               124.13285     ,              50.426229           ]              ,
        	 	"佳木斯东郊机场 ":                            [               130.469934    ,              46.853251           ]              ,
        	 	"嘉义水上机场":                              [               114.246637    ,              22.728826           ]              ,
        	 	"嘉峪关机场 ":                              [               98.348848     ,              39.868617           ]              ,
        	 	"揭阳潮汕国际机场":                            [               116.519223    ,              23.554619           ]              ,
        	 	"吉林二台子机场 ":                            [               126.426107    ,              44.001574           ]              ,
        	 	"济南遥墙国际机场":                            [               117.220024    ,              36.857615           ]              ,
        	 	"金昌金川机场":                              [               102.352908    ,              38.546691           ]              ,
        	 	"景德镇罗家机场 ":                            [               117.190106    ,              29.338375           ]              ,
        	 	"井冈山机场 ":                              [               114.754321    ,              26.857204           ]              ,
        	 	"金门尚义机场":                              [               118.379772    ,              24.453685           ]              ,
        	 	"济宁曲阜机场":                              [               116.363233    ,              35.303038           ]              ,
        	 	"锦州锦州湾机场 ":                            [               121.292494    ,              40.938548           ]              ,
        	 	"九江庐山机场":                              [               115.813805    ,              29.488738           ]              ,
        	 	"九寨黄龙机场":                              [               103.694725    ,              32.856884           ]              ,
        	 	"鸡西兴凯湖机场 ":                            [               131.19407     ,              45.309138           ]              ,
        	 	"凯里黄平机场":                              [               107.99003     ,              26.978687           ]              ,
        	 	"喀什机场  ":                              [               76.020707     ,              39.542484           ]              ,
        	 	"克拉玛依机场":                              [               84.965837     ,              45.474533           ]              ,
        	 	"库车龟兹机场":                              [               82.882797     ,              41.689382           ]              ,
        	 	"库尔勒机场 ":                              [               86.14977      ,              41.628738           ]              ,
        	 	"昆明长水国际机场":                            [               102.936818    ,              25.104579           ]              ,
        	 	"拉萨贡嘎国际机场":                            [               90.908025     ,              29.296161           ]              ,
        	 	"兰州中川国际机场":                            [               103.622763    ,              36.512275           ]              ,
        	 	"连云港白塔埠机场":                            [               118.888422    ,              34.57024            ]              ,
        	 	"荔波机场  ":                              [               107.974374    ,              25.44941            ]              ,
        	 	"丽江三义国际机场":                            [               100.255596    ,              26.674474           ]              ,
        	 	"临沧博尚机场":                              [               100.033727    ,              23.747581           ]              ,
        	 	"临汾乔李机场":                              [               111.65004     ,              36.136396           ]              ,
        	 	"林西机场  ":                              [               118.110216    ,              43.771462           ]              ,
        	 	"临沂沭埠岭机场 ":                            [               118.419676    ,              35.054479           ]              ,
        	 	"林芝米林机场":                              [               94.342806     ,              29.312636           ]              ,
        	 	"黎平机场  ":                              [               109.165119    ,              26.322642           ]              ,
        	 	"六盘水月照机场 ":                            [               104.979145    ,              26.609053           ]              ,
        	 	"柳州白莲机场":                              [               109.409919    ,              24.209098           ]              ,
        	 	"龙岩冠豸山机场 ":                            [               116.765554    ,              25.685391           ]              ,
        	 	"洛阳北郊机场":                              [               112.398812    ,              34.741476           ]              ,
        	 	"泸州蓝田机场":                              [               105.388594    ,              28.847541           ]              ,
        	 	"吕梁大武机场":                              [               111.151571    ,              37.69155            ]              ,
        	 	"满洲里西郊国际机场":                           [               117.346433    ,              49.578928           ]              ,
        	 	"马祖北竿机场":                              [               95.79292      ,              31.432119           ]              ,
        	 	"马祖南竿机场":                              [               95.79292      ,              31.432119           ]              ,
        	 	"梅州梅县长岗岌机场":                           [               116.126403    ,              24.304571           ]              ,
        	 	"绵阳南郊机场":                              [               104.756519    ,              31.431816           ]              ,
        	 	"漠河古莲机场":                              [               122.433588    ,              52.932645           ]              ,
        	 	"牡丹江海浪机场 ":                            [               129.596095    ,              44.543339           ]              ,
        	 	"那拉提机场 ":                              [               83.385719     ,              43.435833           ]              ,
        	 	"南昌昌北国际机场":                            [               115.918503    ,              28.863106           ]              ,
        	 	"南充高坪机场":                              [               106.172461    ,              30.79416            ]              ,
        	 	"南京禄口国际机场":                            [               118.88325     ,              31.736253           ]              ,
        	 	"南宁吴圩国际机场":                            [               108.192499    ,              22.606707           ]              ,
        	 	"南沙永暑礁机场 ":                            [               112.94752     ,              9.523751            ]              ,
        	 	"南通兴东国际机场":                            [               120.986705    ,              32.076878           ]              ,
        	 	"南阳姜营机场":                              [               112.626396    ,              32.987077           ]              ,
        	 	"宁波栎社国际机场":                            [               121.472906    ,              29.824821           ]              ,
        	 	"宁蒗泸沽湖机场 ":                            [               100.783383    ,              27.673206           ]              ,
        	 	"攀枝花保安营机场":                            [               101.802194    ,              26.540825           ]              ,
        	 	"屏东机场  ":                              [               119.308468    ,              26.107057           ]              ,
        	 	"普洱思茅机场":                              [               100.969591    ,              22.799377           ]              ,
        	 	"黔江武陵山机场 ":                            [               108.840418    ,              29.520791           ]              ,
        	 	"且末机场  ":                              [               85.506366     ,              38.100709           ]              ,
        	 	"七美机场  ":                              [               131.012916    ,              45.771085           ]              ,
        	 	"青岛流亭国际机场":                            [               120.393137    ,              36.272238           ]              ,
        	 	"庆阳西峰机场":                              [               107.617272    ,              35.807496           ]              ,
        	 	"秦皇岛山海关机场":                            [               119.72971     ,              39.972697           ]              ,
        	 	"齐齐哈尔三家子机场":                           [               123.931125    ,              47.259933           ]              ,
        	 	"泉州晋江国际机场":                            [               118.598594    ,              24.806761           ]              ,
        	 	"衢州机场  ":                              [               118.907664    ,              28.974229           ]              ,
        	 	"日喀则和平机场 ":                            [               89.307203     ,              29.352643           ]              ,
        	 	"日照山字河机场 ":                            [               119.334423    ,              35.405947           ]              ,
        	 	"三亚凤凰国际机场":                            [               109.418797    ,              18.313637           ]              ,
        	 	"上海虹桥国际机场":                            [               121.334574    ,              31.200171           ]              ,
        	 	"上海浦东国际机场":                            [               121.81502     ,              31.157386           ]              ,
        	 	"上饶三清山机场 ":                            [               117.999903    ,              28.467742           ]              ,
        	 	"韶关丹霞山机场 ":                            [               113.594461    ,              24.80296            ]              ,
        	 	"神农架红坪机场 ":                            [               110.3446730000,               31.6351140000         ]              ,
        	 	"沈阳桃仙国际机场":                            [               123.500408    ,              41.643593           ]              ,
        	 	"深圳宝安国际机场":                            [               113.820131    ,              22.630569           ]              ,
        	 	"石河子花园机场 ":                            [               86.041865     ,              44.308259           ]              ,
        	 	"石家庄正定国际机场":                           [               114.704277    ,              38.282791           ]              ,
        	 	"十堰武当山机场 ":                            [               110.916744    ,              32.592994           ]              ,
        	 	"塔城机场  ":                              [               83.349021     ,              46.676323           ]              ,
        	 	"台北松山机场":                              [               0             ,              0                   ]              ,
        	 	"台东丰年机场":                              [               120.018791    ,              35.873125           ]              ,
        	 	"台南机场  ":                              [               121.360528    ,              38.965849           ]              ,
        	 	"台湾桃园国际机场":                            [               0             ,              0                   ]              ,
        	 	"太原武宿国际机场":                            [               112.641844    ,              37.759825           ]              ,
        	 	"台中清泉岗机场 ":                            [               119.337633    ,              26.091194           ]              ,
        	 	"台州路桥机场":                              [               121.428145    ,              28.56122            ]              ,
        	 	"唐山三女河机场 ":                            [               118.006218    ,              39.7303             ]              ,
        	 	"腾冲驼峰机场":                              [               98.489369     ,              24.942615           ]              ,
        	 	"天津滨海国际机场":                            [               117.365344    ,              39.136235           ]              ,
        	 	"天水麦积山机场 ":                            [               105.874649    ,              34.560739           ]              ,
        	 	"通化三源浦机场 ":                            [               125.756204    ,              42.060104           ]              ,
        	 	"通辽机场  ":                              [               122.216952    ,              43.565156           ]              ,
        	 	"铜仁凤凰机场":                              [               109.316852    ,              27.888212           ]              ,
        	 	"吐鲁番交河机场 ":                            [               89.109909     ,              43.034312           ]              ,
        	 	"万州五桥机场":                              [               108.438668    ,              30.804131           ]              ,
        	 	"潍坊南苑机场":                              [               119.125659    ,              36.647119           ]              ,
        	 	"威海大水泊国际机场":                           [               122.24825     ,              37.19525            ]              ,
        	 	"文山普者黑机场 ":                            [               104.340542    ,              23.569081           ]              ,
        	 	"温州龙湾国际机场":                            [               120.858742    ,              27.919948           ]              ,
        	 	"乌海机场  ":                              [               106.814868    ,              39.799205           ]              ,
        	 	"武汉天河国际机场":                            [               114.217379    ,              30.776258           ]              ,
        	 	"乌兰察布集宁机场":                            [               113.125012    ,              41.131701           ]              ,
        	 	"乌兰浩特依勒力特机场":                          [               122.081534    ,              46.116944           ]              ,
        	 	"乌鲁木齐地窝堡机场":                           [               87.484684     ,              43.90969            ]              ,
        	 	"无锡苏南硕放国际机场":                          [               120.439442    ,              31.509027           ]              ,
        	 	"武夷山机场 ":                              [               118.011532    ,              27.710607           ]              ,
        	 	"梧州长洲岛机场 ":                            [               111.262547    ,              23.459468           ]              ,
        	 	"厦门高崎国际机场":                            [               118.138758    ,              24.540416           ]              ,
        	 	"香港赤鱲角国际机场":                           [               113.94728     ,              22.318657           ]              ,
        	 	"襄阳刘集机场":                              [               112.301567    ,              32.155506           ]              ,
        	 	"西安咸阳国际机场":                            [               108.76709     ,              34.441706           ]              ,
        	 	"西昌青山机场":                              [               102.196289    ,              27.98489            ]              ,
        	 	"锡林浩特机场":                              [               115.972426    ,              43.925265           ]              ,
        	 	"邢台褡裢机场":                              [               114.520487    ,              37.069531           ]              ,
        	 	"兴义万峰林机场 ":                            [               104.965882    ,              25.087013           ]              ,
        	 	"西宁曹家堡机场 ":                            [               102.046527    ,              36.531243           ]              ,
        	 	"忻州五台山机场 ":                            [               112.997697    ,              38.605583           ]              ,
        	 	"西双版纳嘎洒国际机场":                          [               100.774319    ,              21.977242           ]              ,
        	 	"徐州观音国际机场":                            [               117.567361    ,              34.058054           ]              ,
        	 	"延安二十里铺机场":                            [               109.563193    ,              36.64553            ]              ,
        	 	"盐城南洋国际机场":                            [               120.215175    ,              33.436101           ]              ,
        	 	"扬州泰州国际机场":                            [               119.725804    ,              32.565303           ]              ,
        	 	"延吉朝阳川国际机场":                           [               129.454642    ,              42.895429           ]              ,
        	 	"烟台蓬莱国际机场":                            [               120.998674    ,              37.664345           ]              ,
        	 	"宜宾菜坝机场":                              [               104.562193    ,              28.801421           ]              ,
        	 	"宜昌三峡机场":                              [               111.492331    ,              30.552947           ]              ,
        	 	"伊春林都机场":                              [               129.029169    ,              47.757842           ]              ,
        	 	"宜春明月山机场 ":                            [               114.322639    ,              27.802433           ]              ,
        	 	"银川河东国际机场":                            [               106.396727    ,              38.329916           ]              ,
        	 	"营口兰旗机场":                              [               122.362163    ,              40.549067           ]              ,
        	 	"伊宁机场  ":                              [               81.339643     ,              43.958538           ]              ,
        	 	"义乌机场  ":                              [               120.038869    ,              29.346399           ]              ,
        	 	"永州零陵机场":                              [               111.624354    ,              26.347486           ]              ,
        	 	"右旗巴丹吉林机场":                            [               102.443856    ,              40.186229           ]              ,
        	 	"榆林榆阳机场":                              [               109.608985    ,              38.367685           ]              ,
        	 	"运城关公机场":                              [               111.049722    ,              35.119172           ]              ,
        	 	"玉树巴塘机场":                              [               97.045079     ,              32.843811           ]              ,
        	 	"张家界荷花国际机场":                           [               110.457773    ,              29.109857           ]              ,
        	 	"张家口宁远机场 ":                            [               114.961845    ,              40.752784           ]              ,
        	 	"张掖甘州机场":                              [               100.662678    ,              38.820469           ]              ,
        	 	"湛江机场":                                [               110.372695    ,              21.218207           ]              ,
        	 	"昭通机场":                                [               103.761262    ,              27.330297           ]              ,
        	 	"郑州新郑国际机场":                            [               113.852683    ,              34.530807           ]              ,
        	 	"中卫沙坡头机场":                             [               105.163408    ,              37.575209           ]              ,
        	 	"舟山普陀山机场":                             [               122.368207    ,              29.938086           ]              ,
        	 	"珠海金湾机场":                              [               113.381493    ,              22.015462           ]              ,
        	 	"遵义新舟国际机场":                            [               107.26045     ,              27.805915           ]              ,
        	 	"左旗巴彦浩特通勤机场":                          [               105.038247    ,              39.547806           ]              
        		} ;
        var  tempHbdata = ["阿坝红原机场",
                           "阿尔山伊尔施机场",
                    	"阿克苏温宿机场",
                    	"阿勒泰机场 ",
                    	"阿里昆莎机场",
                    	"安康富强机场",
                    	"安庆天柱山机场",
                    	"鞍山腾鳌机场",
                    	"安顺黄果树机场 ",
                    	"安阳北郊机场",
                    	"澳门国际机场",
                    	"百色田阳机场",
                    	"保山云端机场",
                    	"包头二里半机场",
                    	"巴彦淖尔天吉泰机场",
                    	"北海福成机场",
                    	"北京南苑国际机场",
                    	"北京首都国际机场",
                    	"毕节飞雄机场",
                    	"博乐阿拉山口机场",
                    	"布尔津喀纳斯机场",
                    	"长白山机场 ",
                    	"长春龙嘉国际机场",
                    	"常德桃花源机场",
                    	"昌都邦达机场",
                    	"长海大长山岛机场",
                    	"长沙黄花国际机场",
                    	"长治王村机场",
                    	"常州奔牛国际机场",
                    	"朝阳机场",
                    	"成都双流国际机场",
                    	"赤峰玉龙机场",
                    	"池州九华山机场",
                    	"重庆江北国际机场",
                    	"大理荒草坝机场",
                    	"丹东浪头国际机场",
                    	"稻城亚丁机场",
                    	"大庆萨尔图机场",
                    	"大同云冈机场",
                    	"达州河市机场",
                    	"德宏芒市机场",
                    	"迪庆香格里拉机场",
                    	"东营胜利机场",
                    	"敦煌莫高煌机场",
                    	"大连周水子国际机场",
                    	"鄂尔多斯伊金霍洛国际机场",
                    	"额济纳旗桃来机场",
                    	"恩施许家坪机场",
                    	"二连浩特赛乌苏国际机场",
                    	"佛山沙堤机场",
                    	"阜阳西关机场",
                    	"抚远东极机场",
                    	"富蕴可可托海机场",
                    	"福州长乐国际机场",
                    	"甘南夏河机场",
                    	"赣州黄金机场",
                    	"甘孜康定",
                    	"高雄国际机场",
                    	"格尔木机场",
                    	"广元盘龙机场",
                    	"广州白云国际机场",
                    	"桂林两江国际机场",
                    	"贵阳龙洞堡国际机场",
                    	"固原六盘山机场",
                    	"哈尔滨太平国际机场",
                    	"海口美兰国际机场",
                    	"呼伦贝尔东山机场",
                    	"哈密机场",
                    	"邯郸机场",
                    	"杭州萧山国际机场",
                    	"汉中城固机场",
                    	"河池金城江机场",
                    	"合肥新桥国际机场",
                    	"海西德令哈机场 ",
                    	"黑河瑷珲机场",
                    	"恒春五里亭机场 ",
                    	"衡阳南岳机场",
                    	"和田机场  ",
                    	"淮安涟水国际机场",
                    	"怀化芷江机场",
                    	"花莲机场  ",
                    	"黄山屯溪国际机场",
                    	"花土沟机场 ",
                    	"呼和浩特白塔国际机场",
                    	"惠州平潭机场",
                    	"加格达奇嘎仙机场",
                    	"佳木斯东郊机场 ",
                    	"嘉义水上机场",
                    	"嘉峪关机场 ",
                    	"揭阳潮汕国际机场",
                    	"吉林二台子机场 ",
                    	"济南遥墙国际机场",
                    	"金昌金川机场",
                    	"景德镇罗家机场 ",
                    	"井冈山机场 ",
                    	"金门尚义机场",
                    	"济宁曲阜机场",
                    	"锦州锦州湾机场 ",
                    	"九江庐山机场",
                    	"九寨黄龙机场",
                    	"鸡西兴凯湖机场 ",
                    	"凯里黄平机场",
                    	"喀什机场  ",
                    	"克拉玛依机场",
                    	"库车龟兹机场",
                    	"库尔勒机场 ",
                    	"昆明长水国际机场",
                    	"拉萨贡嘎国际机场",
                    	"兰州中川国际机场",
                    	"连云港白塔埠机场",
                    	"荔波机场  ",
                    	"丽江三义国际机场",
                    	"临沧博尚机场",
                    	"临汾乔李机场",
                    	"林西机场  ",
                    	"临沂沭埠岭机场 ",
                    	"林芝米林机场",
                    	"黎平机场  ",
                    	"六盘水月照机场 ",
                    	"柳州白莲机场",
                    	"龙岩冠豸山机场 ",
                    	"洛阳北郊机场",
                    	"泸州蓝田机场",
                    	"吕梁大武机场",
                    	"满洲里西郊国际机场",
                    	"马祖北竿机场",
                    	"马祖南竿机场",
                    	"梅州梅县长岗岌机场",
                    	"绵阳南郊机场",
                    	"漠河古莲机场",
                    	"牡丹江海浪机场 ",
                    	"那拉提机场 ",
                    	"南昌昌北国际机场",
                    	"南充高坪机场",
                    	"南京禄口国际机场",
                    	"南宁吴圩国际机场",
                    	"南沙永暑礁机场 ",
                    	"南通兴东国际机场",
                    	"南阳姜营机场",
                    	"宁波栎社国际机场",
                    	"宁蒗泸沽湖机场 ",
                    	"攀枝花保安营机场",
                    	"屏东机场  ",
                    	"普洱思茅机场",
                    	"黔江武陵山机场 ",
                    	"且末机场  ",
                    	"七美机场  ",
                    	"青岛流亭国际机场",
                    	"庆阳西峰机场",
                    	"秦皇岛山海关机场",
                    	"齐齐哈尔三家子机场",
                    	"泉州晋江国际机场",
                    	"衢州机场  ",
                    	"日喀则和平机场 ",
                    	"日照山字河机场 ",
                    	"三亚凤凰国际机场",
                    	"上海虹桥国际机场",
                    	"上海浦东国际机场",
                    	"上饶三清山机场 ",
                    	"韶关丹霞山机场 ",
                    	"神农架红坪机场 ",
                    	"沈阳桃仙国际机场",
                    	"深圳宝安国际机场",
                    	"石河子花园机场 ",
                    	"石家庄正定国际机场",
                    	"十堰武当山机场 ",
                    	"塔城机场  ",
                    	"台北松山机场",
                    	"台东丰年机场",
                    	"台南机场  ",
                    	"台湾桃园国际机场",
                    	"太原武宿国际机场",
                    	"台中清泉岗机场 ",
                    	"台州路桥机场",
                    	"唐山三女河机场 ",
                    	"腾冲驼峰机场",
                    	"天津滨海国际机场",
                    	"天水麦积山机场 ",
                    	"通化三源浦机场 ",
                    	"通辽机场  ",
                    	"铜仁凤凰机场",
                    	"吐鲁番交河机场 ",
                    	"万州五桥机场",
                    	"潍坊南苑机场",
                    	"威海大水泊国际机场",
                    	"文山普者黑机场 ",
                    	"温州龙湾国际机场",
                    	"乌海机场  ",
                    	"武汉天河国际机场",
                    	"乌兰察布集宁机场",
                    	"乌兰浩特依勒力特机场",
                    	"乌鲁木齐地窝堡机场",
                    	"无锡苏南硕放国际机场",
                    	"武夷山机场 ",
                    	"梧州长洲岛机场 ",
                    	"厦门高崎国际机场",
                    	"香港赤鱲角国际机场",
                    	"襄阳刘集机场",
                    	"西安咸阳国际机场",
                    	"西昌青山机场",
                    	"锡林浩特机场",
                    	"邢台褡裢机场",
                    	"兴义万峰林机场 ",
                    	"西宁曹家堡机场 ",
                    	"忻州五台山机场 ",
                    	"西双版纳嘎洒国际机场",
                    	"徐州观音国际机场",
                    	"延安二十里铺机场",
                    	"盐城南洋国际机场",
                    	"扬州泰州国际机场",
                    	"延吉朝阳川国际机场",
                    	"烟台蓬莱国际机场",
                    	"宜宾菜坝机场",
                    	"宜昌三峡机场",
                    	"伊春林都机场",
                    	"宜春明月山机场 ",
                    	"银川河东国际机场",
                    	"营口兰旗机场",
                    	"伊宁机场  ",
                    	"义乌机场  ",
                    	"永州零陵机场",
                    	"右旗巴丹吉林机场",
                    	"榆林榆阳机场",
                    	"运城关公机场",
                    	"玉树巴塘机场",
                    	"张家界荷花国际机场",
                    	"张家口宁远机场 ",
                    	"张掖甘州机场",
                    	"湛江机场  ",
                    	"昭通机场  ",
                    	"郑州新郑国际机场",
                    	"中卫沙坡头机场 ",
                    	"舟山普陀山机场 ",
                    	"珠海金湾机场 ",
                    	"遵义新舟国际机场",
                    	"左旗巴彦浩特通勤机场" ];
        var aa = [];
        for(var key in amap){
        	var obj = new Object();
        	obj.name = key;
        	obj.value = amap[key].concat("3");
        	aa.push(obj);
        }
        series.push({
            type: 'effectScatter',
            coordinateSystem: 'bmap',
            symbol:'circle',
            symbolSize: 4, 
            //symbolOffset:[0,-8],
            zlevel: 10,
            label: {
                normal: {
                    show: true,
                    position: 'right',
                    formatter: '{b}'
                },
                emphasis:{
                    show:true
                }
            },
            itemStyle: {
                normal: {
                	 color: "#7fbce9"  //终点或者经停点颜色
                }
            },
            data: aa
        });
        console.debug(series);
        option.series=series;
        myChart.setOption(option, true);
    }
    option = {
            title : {
                show:false,
                text: '模拟迁徙',
                subtext: '数据纯属虚构',
                left: 'center',
                textStyle : {
                    color: '#fff'
                }
            },
            	bmap:{
                    center:[],
                    zoom: 6,
                    color:"red",
                    roam:"move",
                    mapStyle: {
                        'styleJson': [
                                      { //海洋颜色
                       "featureType": "water",
                       "elementType": "all",
                       "stylers": {
                           "color": "#071327",
                           "visibility": "on"
                                          }
                                      },
                                      { //陆地颜色
                       "featureType": "land",
                       "elementType": "all",
                       "stylers": {
                           "color": "#223350",
                           "visibility": "on"
                                          }
                                      },
                                      { //行政区划（边界）
                       "featureType": "boundary",
                       "elementType": "all",
                       "stylers": {
                           "color": "#465b6c",
                           "visibility": "on"
                                          }
                                      },
                                      { //城市主路
                       "featureType": "arterial",
                       "elementType": "all",
                       "stylers": {
                           "visibility": "off"
                                          }
                                      },
                                      { //城市主路
                       "featureType": "highway",
                       "elementType": "all",
                       "stylers": {
                           "visibility": "off"
                                          }
                                      },
                                      {  //行政标注
                       "featureType": "label",
                       "elementType": "all",
                       "stylers": {
                           "visibility": "off"
                                          }
                                      }

                        ]
                    }
            	},
            tooltip : {
                showDelay:0,
                enterable:"true",
                alwaysShowContent:"true",//默认一直显示提示框
                triggerOn:"click",//点击触发提示框
                trigger: 'item',
                formatter:function(params){
                }
            },
            series: series
        };
    /*if (option && typeof option === "object") {
        myChart.setOption(option, true);
    };*/
    /*改变窗口大小*/
    /*放大*/
    $(".pla-zoom>div:nth-of-type(1)").click(function(){
        var num = myChart.getOption();//获取上次保留的实时数据
        if(num.bmap[0].zoom<7){
            num.bmap[0].zoom+=1;
            myChart.setOption(num, true);
        }
    });
    /*缩小*/
    $(".pla-zoom>div:nth-of-type(2)").click(function(){
        var num = myChart.getOption();//获取上次保留的实时数据
        if(num.bmap[0].zoom>5){
            num.bmap[0].zoom-=1;
            myChart.setOption(num, true);
        }
    });

    /*浮层选择航线*/
    $(".pla-promptBox-rate>ul>li").on("click",function(){
        var num = myChart.getOption();
        for(var i=0;i<Odata.success.airportOnLineData.length;i++){
            var nOdata=Odata.success.airportOnLineData[i].flyNum.split(",");
            for(var j=0;j<nOdata.length;j++){
                if( $(this).parent().prev().html()==nOdata[j]){
                    if(Odata.success.airportOnLineData[i].dptAirport){
                        if(airportMap[Odata.success.airportOnLineData[i].dptAirport].ctyChaNam==Odata.success.airportName){
                            num.series[2].data=[{
                                coords:[geoCoordMap[Odata.success.airportOnLineData[i].dptAirport],geoCoordMap[Odata.success.airportOnLineData[i].airport]],
                                lineStyle: {
                                    normal: {
                                        color:"#3887be"
                                    }
                                }
                            },{
                                coords:[geoCoordMap[Odata.success.airportOnLineData[i].dptAirport],geoCoordMap[Odata.success.airportOnLineData[i].arrAirport]],
                                lineStyle: {
                                    normal: {
                                        color:"#3887be"
                                    }
                                }
                            }];
                        }else {
                            num.series[2].data=[{
                                coords:[geoCoordMap[Odata.success.airportOnLineData[i].airport],geoCoordMap[Odata.success.airportOnLineData[i].dptAirport]],
                                lineStyle: {
                                    normal: {
                                        color:"#3887be"
                                    }
                                }
                            },{
                                coords:[geoCoordMap[Odata.success.airportOnLineData[i].dptAirport],geoCoordMap[Odata.success.airportOnLineData[i].arrAirport]],
                                lineStyle: {
                                    normal: {
                                        color:"#3887be"
                                    }
                                }
                            }];
                        }
                    }else {//两点
                        num.series[2].data=[{
                            coords:[geoCoordMap[Odata.success.airportOnLineData[i].airport],geoCoordMap[Odata.success.airportOnLineData[i].arrAirport]],
                            lineStyle: {
                                normal: {
                                    color:"#3887be"
                                }
                            }
                        }];
                    }
                }
            }
        }
    });
    var summaryData={};
    function getLinesData(data){
    	var keydata = convertData(HBData);
    	var olddata = data.success.airportOnLineData;
    	var airportCode = data.success.airportCode;
    	for(var a=0; a<keydata.length;a++){
    		var objtemp = keydata[a];
    		var objvalue = objtemp.fromName + "-" + objtemp.toName;
    		var fromiata = airportMap[objtemp.fromName].iata;
    		//占时只考虑了到达的城市有两个以上机场的情况，没有考虑去的城市有两个机场的情况
    		var toiatatemp1 = airportMap[objtemp.toName].iata;
    		var dataee = new Array();
			var tostrtemp1 = toiatatemp1.split("/");
			for(i=0; i<tostrtemp1.length;i++){
				var flage = 0;
				var listobj = new Object();
				var toiata = tostrtemp1[i];
				var lines2 =toiata + fromiata;
				var lines1 =fromiata + toiata;
				var tempName  = new Array();
				var tempCode  = new Array();
				var allCity  = new Object();
				var allCityChiled  = new Object();
				for(var b=0; b<olddata.length;b++){
					var dptcode = "";
					var pstcode = "";
					var arrcode = "";
					if(typeof(olddata[b].airport) != "undefined"){
						dptcode = olddata[b].airport;
					}
					if(typeof(olddata[b].dptAirport) != "undefined"){
						pstcode = olddata[b].dptAirport;
					}
					if(typeof(olddata[b].arrAirport) != "undefined"){
						arrcode = olddata[b].arrAirport;
					}
					var linestemp = dptcode + pstcode + arrcode;
					if(("l"+linestemp+"l").indexOf(lines1)>0||("l"+linestemp+"l").indexOf(lines2)>0){
						flage = 1;
						var linesNametemp = "";
						var linnesOjb = new Object();
						var flyNumarr  = olddata[b].flyNum.split(",");
						if(pstcode!=""){
							linesNametemp = airportMap[dptcode].aptChaNam +"-"+ airportMap[pstcode].aptChaNam +"-"+ airportMap[arrcode].aptChaNam;
							linnesOjb["allAir"] = [airportMap[dptcode].aptChaNam,airportMap[pstcode].aptChaNam,airportMap[arrcode].aptChaNam];
							linnesOjb["allCode"] = [dptcode,pstcode,arrcode];
							linnesOjb["allFlight"] = flyNumarr;
							if(airportCode == dptcode){
								linnesOjb["loc"] = 1;
							}
							if(airportCode == pstcode){
								linnesOjb["loc"] = 2;
							}
							if(airportCode == arrcode){
								linnesOjb["loc"] = 3;
							}
						}else{
							linesNametemp = airportMap[dptcode].aptChaNam +"-"+ airportMap[arrcode].aptChaNam;
							linnesOjb["allAir"] = [airportMap[dptcode].aptChaNam,airportMap[arrcode].aptChaNam];
							linnesOjb["allCode"] = [dptcode,arrcode];
							linnesOjb["allFlight"] = flyNumarr;
							if(airportCode == dptcode){
								linnesOjb["loc"] = 1;
							}
							if(airportCode == arrcode){
								linnesOjb["loc"] = 2;
							}
						}
						allCityChiled[linesNametemp] = linnesOjb;
						if(!contains(tempName,airportMap[fromiata].aptChaNam)){
							tempName.push(airportMap[fromiata].aptChaNam);
						}
						if(!contains(tempName,airportMap[toiata].aptChaNam)){
							tempName.push(airportMap[toiata].aptChaNam);
						}
						if(!contains(tempCode,fromiata)){
							tempCode.push(fromiata);
						}
						if(!contains(tempCode,toiata)){
							tempCode.push(toiata);
						}
					}
				}
				listobj["city"] = tempName;
				listobj["code"] = tempCode;
				listobj["allCity"] = allCityChiled;
				if(flage == 1){
					dataee.push(listobj);
				}
			}
			var tempdd = new Object();
			tempdd["list"] = dataee;
    		summaryData[objvalue] = tempdd;
    	}
    }
    //数组是否包含某个值
    function contains(arr, obj) {  
        var i = arr.length;  
        while (i--) {  
            if (arr[i] === obj) {  
                return true;  
            }  
        }  
        return false;  
    }  
    /*提示框动态设置*/
    myChart.on('click', function (params) {
        if(params.seriesType=="lines"){
        	$(".pla-promptBox").css({"left":params.event.offsetX+"px","top":params.event.offsetY+"px"});
           for(var key in summaryData){
               var city=key.split("-");
               if(city.indexOf(params.data.toName)!=-1&&city.indexOf(params.data.fromName)!=-1){
                   var ele="";
                   ele+="<div class='_tipTile _tipFlight' ><div class='_tipTile-box _minTile'><div>"+city[0]+"</div><div>=</div><div>"+city[1]+"</div></div></div><div class='_tipBody'><div class='_tipBodyBox'>";
                   for(var i=0;i<summaryData[key].list.length;i++){
                       ele+="<div class='_tipLines'><div class='_mid-t _tipFlight' abbr='"+summaryData[key].list[i].city+"'><div class='_mid-tag'>"+(i+1)+"</div><div class='_mid-box'><div class='_mid-code'><div class='_mid-max'>"+summaryData[key].list[i].code[0]+"</div> <div class='_mid-min'>=</div><div class='_mid-max'>"+summaryData[key].list[i].code[1]+"</div></div><div class='_mid-city'><div class='_mid-max'><div>"+summaryData[key].list[i].city[0]+"</div></div><div class='_mid-min'>=</div><div class='_mid-max'><div>"+summaryData[key].list[i].city[1]+"</div></div></div></div></div>";
                       for(var k in summaryData[key].list[i].allCity){
                           var ai="";
                           for(var u=0;u<summaryData[key].list[i].allCity[k].allFlight.length;u++){
                               ai+="<div  class='_tipFlight' abbr='"+summaryData[key].list[i].allCity[k].allAir+"-"+summaryData[key].list[i].allCity[k].allFlight[u]+"'>"+summaryData[key].list[i].allCity[k].allFlight[u]+"</div>";
                           }
                           if(summaryData[key].list[i].allCity[k].allCode.length==3){
                               if(summaryData[key].list[i].allCity[k].loc==1){
                                   ele+="<div class='_mid-b'><div class='_mid-b-line _tipFlight'abbr='"+summaryData[key].list[i].allCity[k].allAir+"'><div class='_mid-b-line-h'></div><div class='_mid-b-line-b'><div class='_mid-b-line-b1 _mid-b-line-tag'><h2>"+summaryData[key].list[i].allCity[k].allCode[0]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[0]+"</p></div></div><div class='_mid-b-line-b2'><h2>"+summaryData[key].list[i].allCity[k].allCode[1]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[1]+"</p></div></div><div class='_mid-b-line-b3'><h2>"+summaryData[key].list[i].allCity[k].allCode[2]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[2]+"</p></div></div></div></div><div class='_mid-b-flight'>"+ai+"</div></div>"
                               }else if(summaryData[key].list[i].allCity[k].loc==2){
                                   ele+="<div class='_mid-b'><div class='_mid-b-line _tipFlight'abbr='"+summaryData[key].list[i].allCity[k].allAir+"'><div class='_mid-b-line-h'></div><div class='_mid-b-line-b'><div class='_mid-b-line-b1'><h2>"+summaryData[key].list[i].allCity[k].allCode[0]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[0]+"</p></div></div><div class='_mid-b-line-b2 _mid-b-line-tag'><h2>"+summaryData[key].list[i].allCity[k].allCode[1]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[1]+"</p></div></div><div class='_mid-b-line-b3'><h2>"+summaryData[key].list[i].allCity[k].allCode[2]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[2]+"</p></div></div></div></div><div class='_mid-b-flight'>"+ai+"</div></div>"
                               }else if(summaryData[key].list[i].allCity[k].loc==3){
                                   ele+="<div class='_mid-b'><div class='_mid-b-line _tipFlight'abbr='"+summaryData[key].list[i].allCity[k].allAir+"'><div class='_mid-b-line-h'></div><div class='_mid-b-line-b'><div class='_mid-b-line-b1'><h2>"+summaryData[key].list[i].allCity[k].allCode[0]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[0]+"</p></div></div><div class='_mid-b-line-b2'><h2>"+summaryData[key].list[i].allCity[k].allCode[1]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[1]+"</p></div></div><div class='_mid-b-line-b3 _mid-b-line-tag'><h2>"+summaryData[key].list[i].allCity[k].allCode[2]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[2]+"</p></div></div></div></div><div class='_mid-b-flight'>"+ai+"</div></div>"
                               }
                           }else {
                               if(parseInt(summaryData[key].list[i].allCity[k].loc)==1){
                                   ele+="<div class='_mid-b'><div class='_mid-b-line _tipFlight'abbr='"+summaryData[key].list[i].allCity[k].allAir+"'><div class='_mid-b-line-h1'></div><div class='_mid-b-line-b'><div class='_mid-b-line-b1 _mid-b-line-tag'><h2>"+summaryData[key].list[i].allCity[k].allCode[0]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[0]+"</p></div></div><div class='_mid-b-line-b2'><h2></h2><p></p></div><div class='_mid-b-line-b3'><h2>"+summaryData[key].list[i].allCity[k].allCode[1]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[1]+"</p></div></div></div></div><div class='_mid-b-flight'>"+ai+"</div></div>"
                               }else if(summaryData[key].list[i].allCity[k].loc>1){
                                   ele+="<div class='_mid-b'><div class='_mid-b-line _tipFlight'abbr='"+summaryData[key].list[i].allCity[k].allAir+"'><div class='_mid-b-line-h1'></div><div class='_mid-b-line-b'><div class='_mid-b-line-b1'><h2>"+summaryData[key].list[i].allCity[k].allCode[0]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[0]+"</p></div></div><div class='_mid-b-line-b2'><h2></h2><p></p></div><div class='_mid-b-line-b3 _mid-b-line-tag'><h2>"+summaryData[key].list[i].allCity[k].allCode[1]+"</h2><div><p>"+summaryData[key].list[i].allCity[k].allAir[1]+"</p></div></div></div></div><div class='_mid-b-flight'>"+ai+"</div></div>"
                               }
                           }
                       }
                        ele+="</div>";
                   }
                   ele+="</div>";
                   $(".pla-prompTip").html(ele);
                   tipRight();
                   $(".pla-prompRight").css("display","none");
                   return;
               }
           }
        }
    });
    //
    function tipRight(){
       setTimeout(function(){
           $(".pla-promptBox").css("display","block");
           var topDis = parseInt($('.pla-promptBox').css('top').split('px')[0]);
           var bottomDis = parseInt($(".pla-promptBox").css('bottom').split('px')[0]);
           if(bottomDis<0){
        	   $(".pla-promptBox").css('top',(topDis+bottomDis)+'px'); 
           }
           $("._tipFlight").on("mouseover",function(){
               var fTop=infer("._tipBodyBox")[4];
               var num=$("._tipFlight").index($(this));
               var zTOP=0;
               if(num==0){
                   //$(".pla-prompRight").css("top","0px");//暂时预留
               }else {
                   for(var i=0;i<num;i++){
                       zTOP+=parseFloat($("._tipFlight").eq(i).css("height").split("px")[0]);
                   }
                   $(".pla-prompRight").css("top",zTOP+fTop+"px");
               }
               if($(this).hasClass("_mid-t")){
            	   $(".pla-prompRight-box").html("<div><div class='pla-prompTip-ico'>&#xe61a;</div><div class='pla-prompTip-des'>共飞运营对比</div></div><div><div class='pla-prompTip-ico'>&#xe629;</div><div class='pla-prompTip-des'>航线历史收益统计</div></div><div><div class='pla-prompTip-ico'>&#xe618;</div><div class='pla-prompTip-des'>客源组成</div></div>")
                   $(".pla-prompRight").attr({"tag":num,"flt":1}).css("display","block");
               }else if($(this).hasClass("_mid-b-line")){
            	   $(".pla-prompRight-box").html("<div><div class='pla-prompTip-ico'>&#xe61a;</div><div class='pla-prompTip-des'>共飞运营对比</div></div><div><div class='pla-prompTip-ico'>&#xe629;</div><div class='pla-prompTip-des'>航线历史收益统计</div></div><div><div class='pla-prompTip-ico'>&#xe618;</div><div class='pla-prompTip-des'>客源组成</div></div>")
                   $(".pla-prompRight").attr({"tag":num,"flt":0}).css("display","block");
               }else{
                   if(!$(this).hasClass("_tipTile")){
                	   $(".pla-prompRight-box").html("<div><div class='pla-prompTip-ico'>&#xe628;</div><div class='pla-prompTip-des'>销售报表</div></div><div><div class='pla-prompTip-ico'>&#xe629;</div><div class='pla-prompTip-des'>航线历史收益统计</div></div><div><div class='pla-prompTip-ico'>&#xe624;</div><div class='pla-prompTip-des'>销售动态</div></div>")
                       $(".pla-prompRight").attr({"tag":num,"flt":0}).css("display","block");
                   }
               }
//               if($(this).hasClass("_mid-t")){
//            	   $(".pla-prompRight-box").html("<div><div class='pla-prompTip-ico'>&#xe61a;</div><div class='pla-prompTip-des'>共飞运营对比</div></div><div><div class='pla-prompTip-ico'>&#xe629;</div><div class='pla-prompTip-des'>航线历史收益统计</div></div><div><div class='pla-prompTip-ico'>&#xe618;</div><div class='pla-prompTip-des'>客源组成</div></div><div class='lis'><div class='pla-prompTip-ico'>&#xe628;</div><div class='pla-prompTip-des'>销售报表</div></div>")
//                   $(".pla-prompRight").attr({"tag":num,"flt":1}).css("display","block");
//               }else if($(this).hasClass("_mid-b-line")){
//            	   $(".pla-prompRight-box").html("<div><div class='pla-prompTip-ico'>&#xe61a;</div><div class='pla-prompTip-des'>共飞运营对比</div></div><div><div class='pla-prompTip-ico'>&#xe629;</div><div class='pla-prompTip-des'>航线历史收益统计</div></div><div><div class='pla-prompTip-ico'>&#xe618;</div><div class='pla-prompTip-des'>客源组成</div></div><div class='lis'><div class='pla-prompTip-ico'>&#xe628;</div><div class='pla-prompTip-des'>销售报表</div></div>")
//                   $(".pla-prompRight").attr({"tag":num,"flt":0}).css("display","block");
//               }else{
//                   if(!$(this).hasClass("_tipTile")){
//                	   $(".pla-prompRight-box").html("<div><div class='pla-prompTip-ico'>&#xe628;</div><div class='pla-prompTip-des'>销售报表</div></div><div><div class='pla-prompTip-ico'>&#xe629;</div><div class='pla-prompTip-des'>航线历史收益统计</div></div><div><div class='pla-prompTip-ico'>&#xe624;</div><div class='pla-prompTip-des'>销售动态</div></div><div class='lis'><div class='pla-prompTip-ico'>&#xe669;</div><div class='pla-prompTip-des'>票价趋势</div></div>")
//                       $(".pla-prompRight").attr({"tag":num,"flt":0}).css("display","block");
//                   }
//               }
               $(".pla-prompRight").on("mouseover",function(){
                   $("._tipFlight").removeClass("_pr-set");
                   $("._tipFlight").eq($(".pla-prompRight").attr("tag")).addClass("_pr-set");
               });
               $(".pla-prompRight").on("mouseout",function(){
                   $("._tipFlight").removeClass("_pr-set");
               });
           });
           addBar(".pla-prompTip","._tipBody","._tipBodyBox");
       },20);
    }
    //关闭浮沉框
    $(".pla-promptBox-legTitle>span").on("click",function(){
        $(".pla-promptBox").animate({"opacity":"0"},200,function(){
            var num = myChart.getOption();
            num.series[2].data=[];
            $(".pla-promptBox").css("display","none");
        });
    });
    
    
    /*打开功能窗口*/
    $(".pla-supernatant-del").on("click",function(){ //关闭
        $(".pla-supernatant-cont").animate({"opacity":"0","top":"-30px"},500,function(){
            $(".pla-supernatant-cont").css({"display":"none"});
            $(".pla-supernatant").css({"display":"none","background-color":"rgba(0,0,0,0)"});
        });
    });
    $(".pla-spread").delegate(".menu a","click",function(){ //关闭
        supData.contentType = $(this).html();
        $(".pla-supernatant").css({"display":"block","background-color":"rgba(0,0,0,0.6)"});
        $(".pla-supernatant-cont").css({"display":"block"});
        $(".pla-supernatant-cont").animate({"opacity":"1","top":"5%"},500);
    });
    //窗口改变修改大小
    window.onresize=myChart.resize;
});